package com.example.mengmeng.utils;

/**
 * Created by 陆猛 on 2016/11/7.
 */
public class PetEncyclopedia {

    public static final String alsjxqq="阿拉斯加雪橇犬（学名：Alaskan Malamute），也叫阿拉斯加犬，是最古老的极地雪橇犬之一，它的名字取自爱斯基摩人的伊努伊特族的一个叫做马拉缪特的部落.阿拉斯加雪橇犬结实、有力、肌肉发达而且胸很深。当它们站立时，头部竖直，眼神显得警惕、好奇，给人的感觉是充满活力而且非常傲娇。头部宽阔，耳朵呈三角形，警惕状态时保持竖立。口吻大，宽度从根部向鼻尖渐收，口吻既不显得长而突出，也不显得粗短。被毛浓密，披毛有足够的长度以保护内层柔软的底毛.";
    public static final String adlymyq="澳大利亚牧羊犬是一种具有很强的畜牧和护卫能力的工作犬。他是一个忠诚的伙伴，而且具有全天候工作的毅力。非常和谐，体长略大于身高，中等大小，骨量中等，颜色多变而有个性。他专注且活泼，柔韧而敏捷，肌肉发达但不笨重。被毛中等长度，粗硬";
    public static final String bxq="比熊犬（法语：Bichon Frisé，意指“白色卷毛的玩赏用小狗”）原产于地中海地区，是一种小型犬品种。它们不会自然脱毛，因此毛发需要整理。颜色一般白色。原称巴比熊犬，后缩为比熊犬。怀疑是巴比特犬和水猎融犬的后裔。是一种娇小的、强健的白色粉扑型的狗，具有欢快的性格，从它羽毛般欢快地卷在背后的尾巴和好奇的眼神中就能体现出来";
    public static final String bgq="巴哥犬（pug），原产于中国，富有魅力而且高雅，14世纪末正式命名为“巴哥”其词意古语为“锤头”、“小丑”，狮子鼻或小猴子的意思。巴哥犬容易有睫毛倒插的毛病，头部皱折多，也容易泪管阻塞，而有两条明显的泪痕。";
    public static final String kjq="威尔士柯基犬虽然属于小型犬，但性格非常稳健，完全没有一般小型犬的神经质，是非常适合小孩的守护犬。它们的胆子很大，也相当机警，能高度警惕地守护家园，是最受欢迎小型护卫犬之一。对该犬，我们标准地描述是：外表英勇无畏惧，内心很温和，表现聪慧，凡事充满兴趣，从不羞怯或凶狠，有着小狗的外表，却拥有大狗的灵魂";
    public static final String jmq="金毛犬（英语：Golden Retriever）是比较现代并很流行的狗的品种，是单猎犬，作为用来在猎捕野禽的寻回犬而培养出来的，游泳的续航力极佳。它是最常见的家犬之一，因为它很容易养，有耐心并且对主人要求不多，只要定期的运动，食物和兽医体检就可以了。金毛的独特之处在于它讨人喜欢的性格，是属于匀称、有力、活泼的一个犬种，特征是稳固、身体各部位配合合理，腿既不太长也不笨拙，表情友善，个性热情、机警、自信而且不怕生。";
    public static final String hsq="西伯利亚雪橇犬（俄语：Сибирский хаски，Sibirskiy haski，英语：Siberian husky）常见别名哈士奇。俗名：二哈或撒手没。西伯利亚雪橇犬体重介于25~72磅(16~32kg)，身高大约20~23.5英寸(51~60cm)，是一种中型犬。西伯利亚雪橇犬是原始的古老犬种，在西伯利亚东北部、格陵兰南部生活。哈士奇名字的由来，是源自其独特的嘶哑声。";
    public static final String cq="柴犬是体型中等并且又最古老的犬。柴犬能够应付陡峭的丘陵和山脉的斜坡，拥有灵敏的感官，使得柴犬屡次成为上乘的猎狩犬。柴犬性格活泼、好动；对自己喜欢的玩具、会一天到晚的把玩。对外有极强警惕性户主看家护院：特别是对大型同类，并且不服输。草丛中的耗子、鸟都会是它的猎物及玩具。柴犬是日本国宝，常见的赤色柴犬价格都在6000人民币到15000人民币之间。";
    public static final String cbq="茶杯犬也称茶杯贵宾犬，贵妇犬，卷毛犬。起源于美国，是一种宠物犬。体型在8英寸以下，体重低于4磅。微小茶杯犬体型更小，俗称“娇小”贵宾犬或“口袋”贵宾犬，标准是7英寸以下，体重低于3磅。因其体型之小连放入茶杯都绰绰有余，因此称之茶杯犬";
    public static final String bmq="博美是一种紧凑、短背、活跃的玩赏犬，学名哈多利系博美犬（俗称英系博美犬）[1]  ，是德国狐狸犬的一种，原产德国。它拥有柔软、浓密的底毛和粗硬的皮毛。尾根位置很高，长有浓密饰毛的尾巴卷放在背上。它具有警惕的性格、聪明的表情、轻快的举止和好奇的天性。体型小巧可爱，适合当伴侣犬，白色和棕色的居多。";

    public static final String tm="阿比西尼亚猫又称埃塞俄比亚猫，因其毛色同野兔相像，英国人亦称它为兔猫或球猫。阿比西尼亚猫是人类最早饲喂的猫咪之一，关于它的历史起源至今仍然争论不休。在保存下来的古埃及神猫的木乃伊中，有一种血红色的猫与它十分相像，所以许多人认为它是远古埃及猫的直系后代";
    public static final String lcm="腊肠猫/曼基康猫/短脚猫，原产地：美国，细小的身躯加上肥短的四肢，当它悄悄的走过来的时候，那种无声无息之中渗出的神秘感觉，很容易会令你将它误认作来自梦幻仙境的访客。";
    public static final String jfm="异国短毛猫（加菲猫）是在六十年代的美国，以人工方式将波斯猫等长毛种的猫与美国短毛猫、缅甸猫等交配繁殖出来的品种。当初进行繁殖计划时，异国短毛猫的体形还很瘦弱，波斯猫的饲养者担心纯种波斯猫会被杂种化，有些繁殖者甚至强烈批评它“有损纯种猫”，因而在1968年禁止交配。当然，还是有人暗暗努力，最后发现用美国短毛猫配种，形体才渐渐成型";
    public static final String hxm="异国短毛猫（加菲猫）是在六十年代的美国，以人工方式将波斯猫等长毛种的猫与美国短毛猫、缅甸猫等交配繁殖出来的品种。当初进行繁殖计划时，异国短毛猫的体形还很瘦弱，波斯猫的饲养者担心纯种波斯猫会被杂种化，有些繁殖者甚至强烈批评它“有损纯种猫”，因而在1968年禁止交配。当然，还是有人暗暗努力，最后发现用美国短毛猫配种，形体才渐渐成型";
    public static final String hbm="虎豹猫原名美国短毛猫。属工作猫种，它有着非常结实的体型，粗大的骨骼，肌肉也是很发达，结实胸部肌肉，被毛比较厚，能耐寒冷，身形匀称，没有多余的赘肉，雄性猫比雌性猫体型较大。";
    public static final String elslm="俄罗斯蓝猫（Russian Blue），历史上曾被称做阿契安吉蓝猫，曾有过三种不同的名字。最初是阿契安吉蓝猫。直到20世纪40年代才有现在的名字。另外有段时间它则叫做马耳他猫。证据显示，这种猫确实原产于俄罗斯，因为已在俄罗斯寒带地区发现了同种的猫。俄罗斯蓝猫体型细长，大而直立的尖耳朵，脚掌小而圆，走路像是用脚尖在走。身上披着银蓝色光泽的短被毛，配上修长苗条的体型和轻盈的步态，尽显一派猫中的贵族风度。";
    public static final String dtm="曼赤肯猫又名短腿猫，是天生的短腿，并不是由于疾病或健康问题而导致的发育不良的结果。短腿猫非常善于攀爬,跳跃和奔跑，一点没有受到腿短的影响，反而使得他更加灵活。他并且性格友善、聪明，很快便能学会一些小把戏。它像一个长不大的小孩子，终生都保留着小猫的天真活泼的特性。";
    public static final String bom="布偶猫，发源于美国，又称“布拉多尔猫”，是一种杂交品种。是现存体型最大、体重最重的猫之一。头呈楔形，眼大而圆，被毛丰厚，四肢较长且富有肉感，尾长，身体柔软，毛色有重点色、手套色或双色等等。布偶猫较为温顺好静，对人友善。其美丽优雅又非常类似于狗的性格而又被称为仙女猫，小狗猫。";
    public static final String bsm="波斯猫（Persian cat）是最常见的长毛猫。它是以阿富汗的土种长毛猫和土耳其的安哥拉长毛猫为基础，在英国经过100多年的选种繁殖，于1860年诞生的一个品种。波斯猫有一张讨人喜爱的面庞，长而华丽的背毛，优雅的举止，故有“猫中王子”、“王妃”之称，是世界上爱猫者最喜欢的一种纯种猫，占有极其重要的地位。";
    public static final String ajm="埃及猫(Egyptian Mau)为中型短毛猫品种。胎生，体重2.5-7千克，[1]  皮肤和毛色上都有像豹的斑纹，埃及猫形体适中，肌肉发达。埃及猫是点状虎斑种的猫中唯一不以人工繁殖，而是自然形成点状花纹的猫种，被誉为“小型豹”，身上的点状花纹、或大或小随意分布，脸、四肢和尾巴有条纹图案。额头的眉宇之间有一个圣甲虫图案。";

    public static final String cs="仓鼠（学名：Cricetidae）是仓鼠亚科动物的总称。仓鼠共七属十八种，主要分布于亚洲，少数分布于欧洲。仓鼠体长5-12厘米，除分布在中亚的小仓鼠外，其他种类的仓鼠两颊皆有颊囊，从臼齿侧延伸到肩部，因此得名为仓鼠。这种动物非常迷你和可爱，是一种很强势的独居动物，同时也是一种很受欢迎的宠物。仓鼠目前有21种花色品种，金丝熊，布丁仓鼠，琥珀仓鼠等等";
}
